export default {
  "请输入": "请输入",
  "请选择": "请选择",
  "请上传": "请上传",
  "新建": "新建",
  "编辑": "编辑",
  "删除": "删除",
  "重置": "重置",
  "查询": "查询",
  "更新时间": "更新时间",
  "创建时间": "创建时间",
  "操作": "操作",
  "废料": "废料",
  "消耗品": "消耗品",
  "非消耗品": "非消耗品",
  "上架": "上架",
  "下架": "下架",
  "印花图": "印花图",
  "确认": "确认",
  "取消": "取消",
  "关闭": "关闭",
  "是否确认删除名称为": "是否确认删除名称为",
  "的数据项？": "的数据项？",
  "状态": "状态",
  // 路由国际化
  route: {
    dashboard: '首页',
    document: '项目文档'
  },
  // 登录页面国际化
  login: {
    title: "咖啡机后台管理系统",
    selectPlaceholder: '请选择/输入公司名称',
    username: '用户名',
    password: '密码',
    login: '登 录',
    logging: '登 录 中...',
    code: '验证码',
    rememberPassword: '记住我',
    switchRegisterPage: '立即注册',
    rule: {
      tenantId: {
        required: '请输入您的租户编号'
      },
      username: {
        required: '请输入您的账号'
      },
      password: {
        required: '请输入您的密码'
      },
      code: {
        required: '请输入验证码'
      }
    },
    social: {
      wechat: '微信登录',
      maxkey: 'MaxKey登录',
      topiam: 'TopIam登录',
      gitee: 'Gitee登录',
      github: 'Github登录'
    }
  },
  // 注册页面国际化
  register: {
    selectPlaceholder: '请选择/输入公司名称',
    username: '用户名',
    password: '密码',
    confirmPassword: '确认密码',
    register: '注 册',
    registering: '注 册 中...',
    registerSuccess: '恭喜你，您的账号 {username} 注册成功！',
    code: '验证码',
    switchLoginPage: '使用已有账户登录',
    rule: {
      tenantId: {
        required: '请输入您的租户编号'
      },
      username: {
        required: '请输入您的账号',
        length: '用户账号长度必须介于 {min} 和 {max} 之间'
      },
      password: {
        required: '请输入您的密码',
        length: '用户密码长度必须介于 {min} 和 {max} 之间',
        pattern: '不能包含非法字符：{strings}'
      },
      code: {
        required: '请输入验证码'
      },
      confirmPassword: {
        required: '请再次输入您的密码',
        equalToPassword: '两次输入的密码不一致'
      }
    }
  },
  // 导航栏国际化
  navbar: {
    full: '全屏',
    language: '语言',
    dashboard: '首页',
    document: '项目文档',
    message: '消息',
    layoutSize: '布局大小',
    selectTenant: '选择租户',
    layoutSetting: '布局设置',
    personalCenter: '个人中心',
    logout: '退出登录'
  },
  sidebar: {
    "首页": "首页",
    "订单管理": "订单管理",
    "微信支付": "微信支付",
    "POS机支付": "POS机支付",
    "支付绑定": "支付绑定",
    "订单列表": "订单列表",
    "用户管理": "用户管理",
    "角色管理": "角色管理",
    "菜单管理": "菜单管理",
    "组织管理": "组织管理",
    "基础餐品库": "基础餐品库",
    "菜单模版": "菜单模版",
    "餐品配置": "餐品配置",
    "物料品类": "物料品类"
  },
  products: {
    "餐品码表": "餐品码表",
    "餐品分组": "餐品分组",
    "料仓": "料仓",
    "物料": "物料",
    "物料种类": "物料种类",
    "印花库": "印花库",
    "名称": "名称",
    "码表": "码表",
    "单位": "单位",
    "属性": "属性",
    "种类": "种类",
    "代码": "代码",
    "说明": "说明",
    "参数": "参数",
    "包装": "包装",
    "图片": "图片",
    "视频": "视频",
    "物料工艺": "物料工艺",
    "料仓编号": "料仓编号",
    "默认总容量": "默认总容量",
    "计量方式": "计量方式",
    "缺料警告阀值": "缺料警告阀值",
    "缺料停止阀值": "缺料停止阀值",
    "手动计数": "手动计数",
    "自动计数": "自动计数",
    "半自动计数": "半自动计数",
    "描述": "描述",
    "应用类别": "应用类别",
    "排序": "排序",
    "动图": "动图",
    "冰淇淋": "冰淇淋",
    "咖啡": "咖啡",
    "餐食": "餐食",
    "任务模式": "任务模式",
    "双臂": "双臂",
    "左臂": "左臂",
    "右臂": "右臂",
    "分组图片": "分组图片",
    "打印拉花图": "打印拉花图",
    "备注": "备注",
    "分组": "分组",
    "售价": "售价",
    "应用类型": "应用类型",
    "外部代码": "外部代码",
    "餐品名称": "餐品名称",
    "原价": "原价",
    "餐品售价": "餐品售价",
    "制作超时(秒)": "制作超时(秒)",
    "介绍": "介绍",
    "餐品图": "餐品图",
    "缩略图": "缩略图",
    "餐品图标": "餐品图标",
    "封面": "封面",
    "料仓配置": "料仓配置",
    "复制": "复制",
    "复制餐品": "复制餐品",
    "原餐品名称": "原餐品名称",
    "原餐品说明": "原餐品说明",
    "新餐品名称": "新餐品名称",
    "新餐品介绍": "新餐品介绍",
    "餐品料仓配置": "餐品料仓配置",
    "数量": "数量",
    "类型": "类型",
    "餐品配置": "餐品配置",
    "设备型号": "设备型号",
    "菜单名称": "菜单名称",
    "点餐徽标": "点餐徽标",
    "广告Banner": "广告Banner",
  }

};
